#+title:    Bits
#+property: header-args :dir ..

* Release
** Build
#+begin_src sh :results output verbatim
just release | sed -e "s,\x1B\\[[0-9;]*[a-zA-Z],,g"
#+end_src

#+results:
#+begin_example
   0. 0s  INFO Bundling project...
   1.121s  INFO Compiled [  1/527]: unicode_ident
   1.121s  INFO Compiled [  2/527]: build-script-build
   1.121s  INFO Compiled [  3/527]: build-script-build
   1.121s  INFO Compiled [  4/527]: cfg_if
   1.122s  INFO Compiled [  5/527]: build-script-build
   1.122s  INFO Compiled [  6/527]: version_check
   1.122s  INFO Compiled [  7/527]: build-script-build
   1.122s  INFO Compiled [  8/527]: build-script-build
   1.122s  INFO Compiled [  9/527]: once_cell
   1.122s  INFO Compiled [ 10/527]: build-script-build
   1.122s  INFO Compiled [ 11/527]: bumpalo
   1.122s  INFO Compiled [ 12/527]: unicode_ident
   1.122s  INFO Compiled [ 13/527]: pin_project_lite
   1.122s  INFO Compiled [ 14/527]: futures_core
   1.122s  INFO Compiled [ 15/527]: memchr
   1.122s  INFO Compiled [ 16/527]: futures_sink
   1.122s  INFO Compiled [ 17/527]: pin_utils
   1.122s  INFO Compiled [ 25/527]: futures_channel
   1.122s  INFO Compiled [ 26/527]: smallvec
   1.122s  INFO Compiled [ 27/527]: futures_io
   1.122s  INFO Compiled [ 28/527]: futures_task
   1.122s  INFO Compiled [ 29/527]: slab
   1.123s  INFO Compiled [ 30/527]: itoa
   1.123s  INFO Compiled [ 31/527]: tracing_core
   1.123s  INFO Compiled [ 32/527]: unicode_xid
   1.123s  INFO Compiled [ 33/527]: build-script-build
   1.123s  INFO Compiled [ 34/527]: proc_macro2
   1.123s  INFO Compiled [ 35/527]: serde_core
   1.123s  INFO Compiled [ 36/527]: rustversion
   1.123s  INFO Compiled [ 37/527]: wasm_bindgen_shared
   1.123s  INFO Compiled [ 38/527]: wasm_bindgen_shared
   1.123s  INFO Compiled [ 39/527]: build-script-build
   1.123s  INFO Compiled [ 41/527]: build-script-build
   1.124s  INFO Compiled [ 42/527]: build-script-build
   1.124s  INFO Compiled [ 43/527]: fnv
   1.124s  INFO Compiled [ 44/527]: scopeguard
   1.124s  INFO Compiled [ 45/527]: stable_deref_trait
   1.124s  INFO Compiled [ 46/527]: build-script-build
   1.124s  INFO Compiled [ 47/527]: dioxus_core_types
   1.124s  INFO Compiled [ 48/527]: build-script-build
   1.124s  INFO Compiled [ 49/527]: rustc_hash
   1.124s  INFO Compiled [ 50/527]: quote
   1.125s  INFO Compiled [ 51/527]: build-script-build
   1.125s  INFO Compiled [ 53/527]: lock_api
   1.125s  INFO Compiled [ 56/527]: longest_increasing_subsequence
   1.125s  INFO Compiled [ 57/527]: unicode_segmentation
   1.125s  INFO Compiled [ 58/527]: build-script-build
   1.125s  INFO Compiled [ 59/527]: ident_case
   1.125s  INFO Compiled [ 60/527]: fnv
   1.125s  INFO Compiled [ 61/527]: ryu
   1.125s  INFO Compiled [ 62/527]: lazy_js_bundle
   1.126s  INFO Compiled [ 63/527]: build-script-build
   1.126s  INFO Compiled [ 64/527]: autocfg
   1.126s  INFO Compiled [ 65/527]: writeable
   1.126s  INFO Compiled [ 66/527]: syn
   1.126s  INFO Compiled [ 68/527]: const_format_proc_macros
   1.126s  INFO Compiled [ 69/527]: parking_lot_core
   1.126s  INFO Compiled [ 70/527]: anyhow
   1.126s  INFO Compiled [ 71/527]: convert_case
   1.126s  INFO Compiled [ 73/527]: litemap
   1.126s  INFO Compiled [ 75/527]: build-script-build
   1.126s  INFO Compiled [ 76/527]: mime
   1.126s  INFO Compiled [ 77/527]: build-script-build
   1.127s  INFO Compiled [ 78/527]: percent_encoding
   1.127s  INFO Compiled [ 79/527]: build-script-build
   1.127s  INFO Compiled [ 82/527]: serde_derive
   1.127s  INFO Compiled [ 83/527]: wasm_bindgen_macro_support
   1.127s  INFO Compiled [ 84/527]: futures_macro
   1.127s  INFO Compiled [ 85/527]: synstructure
   1.127s  INFO Compiled [ 86/527]: tracing_attributes
   1.127s  INFO Compiled [ 87/527]: thiserror_impl
   1.127s  INFO Compiled [ 88/527]: pin_project_internal
   1.127s  INFO Compiled [ 89/527]: zerovec_derive
   1.127s  INFO Compiled [ 90/527]: warnings_macro
   1.127s  INFO Compiled [ 91/527]: parking_lot
   1.127s  INFO Compiled [ 92/527]: displaydoc
   1.127s  INFO Compiled [ 93/527]: const_format
   1.127s  INFO Compiled [ 94/527]: darling_core
   1.127s  INFO Compiled [ 95/527]: serde_json
   1.127s  INFO Compiled [ 98/527]: serde
   1.127s  INFO Compiled [ 99/527]: wasm_bindgen_macro
   1.127s  INFO Compiled [100/527]: futures_util
   1.127s  INFO Compiled [101/527]: tracing
   1.127s  INFO Compiled [102/527]: zerofrom_derive
   1.127s  INFO Compiled [103/527]: yoke_derive
   1.127s  INFO Compiled [104/527]: thiserror
   1.127s  INFO Compiled [105/527]: pin_project
   1.127s  INFO Compiled [106/527]: darling_macro
   1.127s  INFO Compiled [107/527]: proc_macro2_diagnostics
   1.127s  INFO Compiled [109/527]: build-script-build
   1.127s  INFO Compiled [110/527]: icu_properties_data
   1.128s  INFO Compiled [111/527]: num_traits
   1.128s  INFO Compiled [112/527]: zerocopy_derive
   1.128s  INFO Compiled [113/527]: typenum
   1.128s  INFO Compiled [114/527]: wasm_bindgen
   1.128s  INFO Compiled [115/527]: bytes
   1.128s  INFO Compiled [116/527]: zerofrom
   1.128s  INFO Compiled [117/527]: subsecond_types
   1.128s  INFO Compiled [118/527]: slotmap
   1.128s  INFO Compiled [119/527]: generational_box
   1.128s  INFO Compiled [120/527]: warnings
   1.128s  INFO Compiled [121/527]: darling
   1.128s  INFO Compiled [122/527]: dioxus_rsx
   1.128s  INFO Compiled [124/527]: icu_normalizer_data
   1.128s  INFO Compiled [125/527]: typenum
   1.128s  INFO Compiled [128/527]: sync_wrapper
   1.128s  INFO Compiled [129/527]: bitflags
   1.128s  INFO Compiled [130/527]: js_sys
   1.128s  INFO Compiled [131/527]: yoke
   1.128s  INFO Compiled [132/527]: http
   1.128s  INFO Compiled [133/527]: dioxus_cli_config
   1.128s  INFO Compiled [134/527]: enumset_derive
   1.128s  INFO Compiled [135/527]: build-script-build
   1.128s  INFO Compiled [136/527]: base64
   1.128s  INFO Compiled [137/527]: generic_array
   1.128s  INFO Compiled [138/527]: dioxus_core_macro
   1.128s  INFO Compiled [139/527]: generic_array
   1.128s  INFO Compiled [140/527]: keyboard_types
   1.128s  INFO Compiled [141/527]: zerocopy
   1.128s  INFO Compiled [142/527]: euclid
   1.128s  INFO Compiled [143/527]: form_urlencoded
   1.128s  INFO Compiled [144/527]: const_serialize_macro
   1.128s  INFO Compiled [145/527]: dioxus_html_internal_macro
   1.129s  INFO Compiled [146/527]: web_sys
   1.129s  INFO Compiled [147/527]: wasm_bindgen_futures
   1.129s  INFO Compiled [148/527]: zerovec
   1.129s  INFO Compiled [149/527]: zerotrie
   1.129s  INFO Compiled [150/527]: enumset
   1.129s  INFO Compiled [152/527]: http_body
   1.129s  INFO Compiled [153/527]: async_trait
   1.129s  INFO Compiled [154/527]: tower_layer
   1.129s  INFO Compiled [155/527]: build-script-build
   1.129s  INFO Compiled [156/527]: build-script-build
   1.129s  INFO Compiled [157/527]: tower_service
   1.129s  INFO Compiled [158/527]: half
   1.130s  INFO Compiled [159/527]: build-script-build
   1.130s  INFO Compiled [160/527]: encoding_rs
   1.130s  INFO Compiled [161/527]: ciborium_io
   1.130s  INFO Compiled [162/527]: subsecond
   1.130s  INFO Compiled [163/527]: tinystr
   1.130s  INFO Compiled [164/527]: potential_utf
   1.130s  INFO Compiled [167/527]: http_body_util
   1.130s  INFO Compiled [168/527]: serde_core
   1.130s  INFO Compiled [169/527]: build-script-build
   1.130s  INFO Compiled [170/527]: regex_syntax
   1.130s  INFO Compiled [171/527]: utf8_iter
   1.130s  INFO Compiled [172/527]: unicase
   1.130s  INFO Compiled [174/527]: ciborium_ll
   1.130s  INFO Compiled [175/527]: crypto_common
   1.130s  INFO Compiled [176/527]: crypto_common
   1.130s  INFO Compiled [177/527]: block_buffer
   1.130s  INFO Compiled [178/527]: dioxus_core
   1.130s  INFO Compiled [179/527]: icu_locale_core
   1.130s  INFO Compiled [180/527]: icu_collections
   1.131s  INFO Compiled [182/527]: build-script-build
   1.131s  INFO Compiled [183/527]: serde
   1.131s  INFO Compiled [184/527]: libc
   1.131s  INFO Compiled [185/527]: regex_automata
   1.131s  INFO Compiled [186/527]: axum_core
   1.131s  INFO Compiled [187/527]: block_buffer
   1.131s  INFO Compiled [188/527]: build-script-build
   1.131s  INFO Compiled [189/527]: tokio
   1.131s  INFO Compiled [190/527]: byteorder
   1.131s  INFO Compiled [191/527]: lazy_static
   1.131s  INFO Compiled [192/527]: uuid
   1.131s  INFO Compiled [193/527]: build-script-build
   1.131s  INFO Compiled [194/527]: dioxus_signals
   1.131s  INFO Compiled [195/527]: icu_provider
   1.131s  INFO Compiled [196/527]: dioxus_history
   1.131s  INFO Compiled [197/527]: matchers
   1.131s  INFO Compiled [199/527]: sharded_slab
   1.131s  INFO Compiled [200/527]: digest
   1.131s  INFO Compiled [201/527]: cpufeatures
   1.131s  INFO Compiled [202/527]: httparse
   1.131s  INFO Compiled [203/527]: const_serialize
   1.131s  INFO Compiled [206/527]: cfb
   1.131s  INFO Compiled [207/527]: ciborium
   1.131s  INFO Compiled [208/527]: digest
   1.131s  INFO Compiled [209/527]: wasm_streams
   1.131s  INFO Compiled [210/527]: icu_normalizer
   1.131s  INFO Compiled [211/527]: dioxus_hooks
   1.131s  INFO Compiled [212/527]: icu_properties
   1.131s  INFO Compiled [213/527]: serde_urlencoded
   1.132s  INFO Compiled [214/527]: sledgehammer_bindgen_macro
   1.132s  INFO Compiled [215/527]: thiserror_impl
   1.132s  INFO Compiled [216/527]: build-script-build
   1.132s  INFO Compiled [217/527]: inventory
   1.132s  INFO Compiled [218/527]: thread_local
   1.132s  INFO Compiled [219/527]: rustc_hash
   1.132s  INFO Compiled [220/527]: unicase
   1.132s  INFO Compiled [221/527]: spin
   1.132s  INFO Compiled [222/527]: utf8parse
   1.132s  INFO Compiled [223/527]: cfg_if
   1.132s  INFO Compiled [224/527]: sha1
   1.132s  INFO Compiled [225/527]: manganis_core
   1.132s  INFO Compiled [226/527]: dioxus_html
   1.132s  INFO Compiled [227/527]: idna_adapter
   1.132s  INFO Compiled [228/527]: thiserror
   1.132s  INFO Compiled [229/527]: tracing_subscriber
   1.132s  INFO Compiled [230/527]: sha2
   1.132s  INFO Compiled [231/527]: sledgehammer_bindgen
   1.132s  INFO Compiled [233/527]: mime_guess
   1.132s  INFO Compiled [234/527]: anstyle_parse
   1.132s  INFO Compiled [235/527]: sledgehammer_utils
   1.132s  INFO Compiled [236/527]: multer
   1.132s  INFO Compiled [237/527]: infer
   1.132s  INFO Compiled [238/527]: dioxus_devtools_types
   1.132s  INFO Compiled [239/527]: tower
   1.132s  INFO Compiled [240/527]: charset
   1.132s  INFO Compiled [241/527]: gloo_utils
   1.132s  INFO Compiled [242/527]: idna
   1.132s  INFO Compiled [243/527]: dioxus_document
   1.132s  INFO Compiled [244/527]: const_serialize
   1.132s  INFO Compiled [245/527]: headers_core
   1.132s  INFO Compiled [246/527]: futures_executor
   1.132s  INFO Compiled [247/527]: derive_more_impl
   1.132s  INFO Compiled [248/527]: const_format
   1.132s  INFO Compiled [249/527]: async_stream_impl
   1.132s  INFO Compiled [250/527]: macro_string
   1.133s  INFO Compiled [251/527]: build-script-build
   1.133s  INFO Compiled [252/527]: serde_path_to_error
   1.133s  INFO Compiled [253/527]: send_wrapper
   1.133s  INFO Compiled [254/527]: anstyle_query
   1.133s  INFO Compiled [255/527]: xxhash_rust
   1.133s  INFO Compiled [256/527]: anstyle
   1.133s  INFO Compiled [257/527]: matchit
   1.133s  INFO Compiled [258/527]: url
   1.133s  INFO Compiled [259/527]: dioxus_fullstack_core
   1.133s  INFO Compiled [260/527]: base16
   1.133s  INFO Compiled [261/527]: dunce
   1.133s  INFO Compiled [262/527]: is_terminal_polyfill
   1.133s  INFO Compiled [263/527]: httpdate
   1.133s  INFO Compiled [264/527]: colorchoice
   1.133s  INFO Compiled [265/527]: slab
   1.133s  INFO Compiled [266/527]: dioxus_fullstack_macro
   1.133s  INFO Compiled [267/527]: derive_more
   1.133s  INFO Compiled [268/527]: manganis_core
   1.133s  INFO Compiled [270/527]: futures
   1.133s  INFO Compiled [271/527]: axum
   1.133s  INFO Compiled [272/527]: async_stream
   1.133s  INFO Compiled [273/527]: dioxus_asset_resolver
   1.133s  INFO Compiled [274/527]: reqwest
   1.133s  INFO Compiled [275/527]: headers
   1.133s  INFO Compiled [276/527]: dioxus_router_macro
   1.133s  INFO Compiled [277/527]: anstream
   1.133s  INFO Compiled [278/527]: manganis_macro
   1.133s  INFO Compiled [279/527]: gloo_net
   1.133s  INFO Compiled [280/527]: dioxus_devtools
   1.133s  INFO Compiled [281/527]: content_disposition
   1.133s  INFO Compiled [282/527]: dioxus_interpreter_js
   1.133s  INFO Compiled [283/527]: tracing_wasm
   1.133s  INFO Compiled [284/527]: serde_wasm_bindgen
   1.133s  INFO Compiled [285/527]: gloo_timers
   1.133s  INFO Compiled [286/527]: serde_qs
   1.133s  INFO Compiled [287/527]: dioxus_stores_macro
   1.133s  INFO Compiled [288/527]: xxhash_rust
   1.133s  INFO Compiled [289/527]: const_str
   1.133s  INFO Compiled [290/527]: strsim
   1.133s  INFO Compiled [291/527]: heck
   1.133s  INFO Compiled [292/527]: clap_lex
   1.133s  INFO Compiled [293/527]: manganis
   1.133s  INFO Compiled [294/527]: dioxus_fullstack
   1.133s  INFO Compiled [295/527]: dioxus_stores
   1.133s  INFO Compiled [296/527]: dioxus_logger
   1.134s  INFO Compiled [297/527]: dioxus_web
   1.134s  INFO Compiled [298/527]: dioxus_router
   1.134s  INFO Compiled [299/527]: dioxus_config_macro
   1.134s  INFO Compiled [300/527]: dioxus_config_macros
   1.134s  INFO Compiled [301/527]: clap_derive
   1.134s  INFO Compiled [302/527]: clap_builder
   1.134s  INFO Compiled [303/527]: dioxus
   1.134s  INFO Compiled [304/527]: clap
   1.134s  INFO Compiled [305/527]: bits
   1.330s  INFO Compiled [306/527]: bits
   1.366s  INFO Bundling app...
   1.366s  INFO Running wasm-bindgen...
   2.387s  INFO Copying asset (1/3): /Users/jcf/code/bits/assets/app.css
   2.387s  INFO Copying asset (2/3): /Users/jcf/code/bits/target/dx/bits/release/web/public/wasm/bits_bg.wasm
   2.392s  INFO Copying asset (3/3): /Users/jcf/code/bits/target/dx/bits/release/web/public/wasm/bits.js
   2.394s  INFO Client build completed successfully! 🚀 path="/Users/jcf/code/bits/target/dx/bits/release/web/public"
   2.641s  INFO Compiled [  1/527]: unicode_ident
   2.641s  INFO Compiled [  2/527]: build-script-build
   2.641s  INFO Compiled [  3/527]: build-script-build
   2.641s  INFO Compiled [  4/527]: build-script-build
   2.641s  INFO Compiled [  5/527]: build-script-build
   2.642s  INFO Compiled [  6/527]: build-script-build
   2.642s  INFO Compiled [  7/527]: cfg_if
   2.642s  INFO Compiled [  8/527]: version_check
   2.642s  INFO Compiled [  9/527]: pin_project_lite
   2.642s  INFO Compiled [ 10/527]: futures_core
   2.642s  INFO Compiled [ 11/527]: once_cell
   2.642s  INFO Compiled [ 12/527]: build-script-build
   2.642s  INFO Compiled [ 13/527]: memchr
   2.642s  INFO Compiled [ 14/527]: itoa
   2.642s  INFO Compiled [ 15/527]: futures_sink
   2.642s  INFO Compiled [ 16/527]: log
   2.642s  INFO Compiled [ 17/527]: futures_task
   2.642s  INFO Compiled [ 23/527]: build-script-build
   2.642s  INFO Compiled [ 24/527]: futures_channel
   2.642s  INFO Compiled [ 25/527]: futures_io
   2.642s  INFO Compiled [ 26/527]: slab
   2.642s  INFO Compiled [ 27/527]: pin_utils
   2.642s  INFO Compiled [ 28/527]: build-script-build
   2.642s  INFO Compiled [ 29/527]: tracing_core
   2.642s  INFO Compiled [ 30/527]: build-script-build
   2.642s  INFO Compiled [ 31/527]: fnv
   2.643s  INFO Compiled [ 32/527]: build-script-build
   2.643s  INFO Compiled [ 34/527]: proc_macro2
   2.643s  INFO Compiled [ 35/527]: serde_core
   2.643s  INFO Compiled [ 36/527]: libc
   2.643s  INFO Compiled [ 39/527]: build-script-build
   2.643s  INFO Compiled [ 40/527]: build-script-build
   2.643s  INFO Compiled [ 41/527]: libc
   2.644s  INFO Compiled [ 43/527]: build-script-build
   2.644s  INFO Compiled [ 44/527]: subtle
   2.644s  INFO Compiled [ 46/527]: shlex
   2.644s  INFO Compiled [ 47/527]: build-script-build
   2.644s  INFO Compiled [ 48/527]: find_msvc_tools
   2.644s  INFO Compiled [ 50/527]: quote
   2.644s  INFO Compiled [ 51/527]: rustversion
   2.644s  INFO Compiled [ 52/527]: typenum
   2.644s  INFO Compiled [ 53/527]: mio
   2.644s  INFO Compiled [ 55/527]: socket2
   2.644s  INFO Compiled [ 56/527]: cc
   2.644s  INFO Compiled [ 57/527]: build-script-build
   2.644s  INFO Compiled [ 58/527]: scopeguard
   2.644s  INFO Compiled [ 59/527]: stable_deref_trait
   2.644s  INFO Compiled [ 60/527]: unicode_xid
   2.644s  INFO Compiled [ 61/527]: cfg_if
   2.644s  INFO Compiled [ 62/527]: autocfg
   2.644s  INFO Compiled [ 64/527]: percent_encoding
   2.644s  INFO Compiled [ 66/527]: syn
   2.644s  INFO Compiled [ 67/527]: generic_array
   2.645s  INFO Compiled [ 68/527]: build-script-build
   2.645s  INFO Compiled [ 69/527]: lock_api
   2.645s  INFO Compiled [ 71/527]: build-script-build
   2.645s  INFO Compiled [ 72/527]: const_format_proc_macros
   2.645s  INFO Compiled [ 73/527]: equivalent
   2.646s  INFO Compiled [ 74/527]: build-script-build
   2.646s  INFO Compiled [ 75/527]: ryu
   2.646s  INFO Compiled [ 76/527]: stable_deref_trait
   2.646s  INFO Compiled [ 77/527]: allocator_api2
   2.646s  INFO Compiled [ 78/527]: typenum
   2.646s  INFO Compiled [ 79/527]: cpufeatures
   2.646s  INFO Compiled [ 82/527]: serde_derive
   2.646s  INFO Compiled [ 83/527]: synstructure
   2.646s  INFO Compiled [ 84/527]: tracing_attributes
   2.646s  INFO Compiled [ 85/527]: futures_macro
   2.646s  INFO Compiled [ 86/527]: zerovec_derive
   2.646s  INFO Compiled [ 87/527]: thiserror_impl
   2.646s  INFO Compiled [ 88/527]: displaydoc
   2.646s  INFO Compiled [ 89/527]: zerocopy_derive
   2.646s  INFO Compiled [ 90/527]: tokio_macros
   2.646s  INFO Compiled [ 91/527]: crypto_common
   2.646s  INFO Compiled [ 92/527]: block_buffer
   2.646s  INFO Compiled [ 93/527]: serde_core
   2.646s  INFO Compiled [ 94/527]: pin_project_internal
   2.646s  INFO Compiled [ 96/527]: build-script-build
   2.646s  INFO Compiled [ 97/527]: writeable
   2.646s  INFO Compiled [ 98/527]: serde
   2.646s  INFO Compiled [ 99/527]: zerofrom_derive
   2.646s  INFO Compiled [100/527]: yoke_derive
   2.646s  INFO Compiled [101/527]: futures_util
   2.646s  INFO Compiled [102/527]: tracing
   2.646s  INFO Compiled [103/527]: thiserror
   2.646s  INFO Compiled [104/527]: zerocopy
   2.646s  INFO Compiled [105/527]: digest
   2.646s  INFO Compiled [106/527]: serde
   2.646s  INFO Compiled [107/527]: pin_project
   2.646s  INFO Compiled [108/527]: dioxus_core_types
   2.646s  INFO Compiled [109/527]: litemap
   2.646s  INFO Compiled [110/527]: bitflags
   2.647s  INFO Compiled [111/527]: build-script-build
   2.647s  INFO Compiled [112/527]: httparse
   2.647s  INFO Compiled [114/527]: bytes
   2.647s  INFO Compiled [115/527]: smallvec
   2.647s  INFO Compiled [116/527]: zerofrom
   2.647s  INFO Compiled [117/527]: zerofrom
   2.647s  INFO Compiled [118/527]: ppv_lite86
   2.647s  INFO Compiled [120/527]: subsecond_types
   2.647s  INFO Compiled [121/527]: serde_json
   2.647s  INFO Compiled [122/527]: generic_array
   2.647s  INFO Compiled [123/527]: warnings_macro
   2.647s  INFO Compiled [124/527]: memmap2
   2.647s  INFO Compiled [125/527]: libloading
   2.647s  INFO Compiled [126/527]: foldhash
   2.647s  INFO Compiled [127/527]: build-script-build
   2.648s  INFO Compiled [128/527]: build-script-build
   2.648s  INFO Compiled [129/527]: base64
   2.648s  INFO Compiled [130/527]: http
   2.648s  INFO Compiled [131/527]: tokio
   2.648s  INFO Compiled [132/527]: parking_lot_core
   2.648s  INFO Compiled [133/527]: yoke
   2.648s  INFO Compiled [134/527]: yoke
   2.648s  INFO Compiled [135/527]: build-script-build
   2.648s  INFO Compiled [136/527]: hashbrown
   2.648s  INFO Compiled [137/527]: anyhow
   2.648s  INFO Compiled [139/527]: warnings
   2.648s  INFO Compiled [140/527]: subsecond
   2.648s  INFO Compiled [141/527]: slotmap
   2.648s  INFO Compiled [142/527]: const_format
   2.648s  INFO Compiled [145/527]: subtle
   2.648s  INFO Compiled [146/527]: parking_lot
   2.648s  INFO Compiled [147/527]: zerovec
   2.648s  INFO Compiled [148/527]: zerotrie
   2.648s  INFO Compiled [149/527]: zerovec
   2.648s  INFO Compiled [150/527]: tokio_util
   2.648s  INFO Compiled [151/527]: longest_increasing_subsequence
   2.648s  INFO Compiled [152/527]: rustc_hash
   2.648s  INFO Compiled [153/527]: getrandom
   2.648s  INFO Compiled [154/527]: http_body
   2.648s  INFO Compiled [155/527]: icu_normalizer_data
   2.648s  INFO Compiled [156/527]: icu_properties_data
   2.648s  INFO Compiled [157/527]: crypto_common
   2.648s  INFO Compiled [158/527]: block_buffer
   2.649s  INFO Compiled [159/527]: getrandom
   2.649s  INFO Compiled [160/527]: indexmap
   2.649s  INFO Compiled [162/527]: tinystr
   2.649s  INFO Compiled [163/527]: potential_utf
   2.649s  INFO Compiled [164/527]: generational_box
   2.649s  INFO Compiled [165/527]: digest
   2.649s  INFO Compiled [166/527]: rand_core
   2.649s  INFO Compiled [167/527]: form_urlencoded
   2.649s  INFO Compiled [168/527]: unicode_segmentation
   2.649s  INFO Compiled [169/527]: mime
   2.649s  INFO Compiled [170/527]: core_foundation_sys
   2.649s  INFO Compiled [171/527]: tower_service
   2.649s  INFO Compiled [172/527]: zeroize
   2.649s  INFO Compiled [173/527]: tinystr
   2.649s  INFO Compiled [174/527]: num_traits
   2.649s  INFO Compiled [176/527]: smallvec
   2.649s  INFO Compiled [177/527]: sha1
   2.649s  INFO Compiled [178/527]: icu_locale_core
   2.649s  INFO Compiled [179/527]: icu_collections
   2.649s  INFO Compiled [180/527]: dioxus_core
   2.649s  INFO Compiled [181/527]: convert_case
   2.649s  INFO Compiled [182/527]: rustls_pki_types
   2.649s  INFO Compiled [183/527]: rand_chacha
   2.649s  INFO Compiled [185/527]: ident_case
   2.649s  INFO Compiled [186/527]: utf8_iter
   2.649s  INFO Compiled [187/527]: writeable
   2.649s  INFO Compiled [188/527]: litemap
   2.649s  INFO Compiled [189/527]: fnv
   2.649s  INFO Compiled [190/527]: wasm_bindgen_shared
   2.649s  INFO Compiled [191/527]: potential_utf
   2.649s  INFO Compiled [192/527]: zerotrie
   2.649s  INFO Compiled [194/527]: icu_provider
   2.649s  INFO Compiled [195/527]: icu_locale_core
   2.649s  INFO Compiled [196/527]: rand
   2.649s  INFO Compiled [197/527]: darling_core
   2.649s  INFO Compiled [198/527]: getrandom
   2.649s  INFO Compiled [199/527]: sync_wrapper
   2.650s  INFO Compiled [200/527]: build-script-build
   2.650s  INFO Compiled [201/527]: untrusted
   2.650s  INFO Compiled [202/527]: atomic_waker
   2.650s  INFO Compiled [203/527]: httpdate
   2.650s  INFO Compiled [204/527]: data_encoding
   2.650s  INFO Compiled [205/527]: tower_layer
   2.650s  INFO Compiled [206/527]: build-script-build
   2.650s  INFO Compiled [207/527]: lazy_js_bundle
   2.650s  INFO Compiled [208/527]: build-script-build
   2.650s  INFO Compiled [209/527]: utf8
   2.650s  INFO Compiled [210/527]: icu_properties
   2.650s  INFO Compiled [211/527]: icu_normalizer
   2.650s  INFO Compiled [212/527]: bumpalo
   2.650s  INFO Compiled [214/527]: icu_provider
   2.650s  INFO Compiled [215/527]: ring
   2.650s  INFO Compiled [216/527]: darling_macro
   2.650s  INFO Compiled [219/527]: icu_collections
   2.650s  INFO Compiled [220/527]: dioxus_signals
   2.650s  INFO Compiled [221/527]: http_body_util
   2.651s  INFO Compiled [222/527]: build-script-build
   2.651s  INFO Compiled [224/527]: cpufeatures
   2.651s  INFO Compiled [226/527]: idna_adapter
   2.651s  INFO Compiled [227/527]: wasm_bindgen_macro_support
   2.651s  INFO Compiled [228/527]: slab
   2.651s  INFO Compiled [229/527]: zeroize
   2.651s  INFO Compiled [230/527]: build-script-build
   2.651s  INFO Compiled [231/527]: try_lock
   2.651s  INFO Compiled [232/527]: unicode_ident
   2.651s  INFO Compiled [233/527]: pin_project_lite
   2.651s  INFO Compiled [234/527]: icu_normalizer_data
   2.651s  INFO Compiled [236/527]: darling
   2.651s  INFO Compiled [237/527]: sha2
   2.651s  INFO Compiled [238/527]: icu_properties_data
   2.651s  INFO Compiled [239/527]: webpki
   2.651s  INFO Compiled [240/527]: system_configuration_sys
   2.651s  INFO Compiled [241/527]: proc_macro2_diagnostics
   2.651s  INFO Compiled [242/527]: idna
   2.651s  INFO Compiled [243/527]: wasm_bindgen_macro
   2.651s  INFO Compiled [244/527]: want
   2.651s  INFO Compiled [245/527]: wasm_bindgen_shared
   2.652s  INFO Compiled [247/527]: rustls_pki_types
   2.652s  INFO Compiled [248/527]: crossbeam_utils
   2.652s  INFO Compiled [249/527]: h2
   2.652s  INFO Compiled [251/527]: core_foundation
   2.652s  INFO Compiled [253/527]: futures_core
   2.652s  INFO Compiled [254/527]: build-script-build
   2.652s  INFO Compiled [255/527]: dioxus_cli_config
   2.652s  INFO Compiled [256/527]: icu_properties
   2.652s  INFO Compiled [257/527]: dioxus_rsx
   2.652s  INFO Compiled [258/527]: url
   2.652s  INFO Compiled [259/527]: crossbeam_utils
   2.652s  INFO Compiled [260/527]: rustls
   2.652s  INFO Compiled [261/527]: wasm_bindgen
   2.652s  INFO Compiled [262/527]: hyper
   2.652s  INFO Compiled [263/527]: system_configuration
   2.652s  INFO Compiled [265/527]: icu_normalizer
   2.652s  INFO Compiled [266/527]: enumset_derive
   2.652s  INFO Compiled [267/527]: webpki_roots
   2.652s  INFO Compiled [269/527]: encoding_rs
   2.652s  INFO Compiled [270/527]: untrusted
   2.652s  INFO Compiled [271/527]: equivalent
   2.652s  INFO Compiled [272/527]: once_cell
   2.652s  INFO Compiled [273/527]: unicase
   2.652s  INFO Compiled [274/527]: ipnet
   2.652s  INFO Compiled [275/527]: scopeguard
   2.652s  INFO Compiled [276/527]: idna_adapter
   2.652s  INFO Compiled [277/527]: parking_lot_core
   2.652s  INFO Compiled [278/527]: ring
   2.652s  INFO Compiled [279/527]: zerocopy
   2.652s  INFO Compiled [280/527]: js_sys
   2.652s  INFO Compiled [281/527]: enumset
   2.653s  INFO Compiled [282/527]: build-script-build
   2.653s  INFO Compiled [283/527]: dioxus_core_macro
   2.653s  INFO Compiled [284/527]: axum_core
   2.653s  INFO Compiled [285/527]: dioxus_hooks
   2.653s  INFO Compiled [286/527]: tower
   2.653s  INFO Compiled [287/527]: build-script-build
   2.653s  INFO Compiled [288/527]: dioxus_html_internal_macro
   2.653s  INFO Compiled [289/527]: euclid
   2.653s  INFO Compiled [290/527]: hyper_util
   2.653s  INFO Compiled [291/527]: lock_api
   2.653s  INFO Compiled [292/527]: keyboard_types
   2.653s  INFO Compiled [293/527]: half
   2.653s  INFO Compiled [294/527]: const_serialize_macro
   2.653s  INFO Compiled [295/527]: async_trait
   2.653s  INFO Compiled [296/527]: socket2
   2.653s  INFO Compiled [297/527]: mio
   2.654s  INFO Compiled [298/527]: build-script-build
   2.654s  INFO Compiled [299/527]: allocator_api2
   2.654s  INFO Compiled [300/527]: foldhash
   2.654s  INFO Compiled [301/527]: ciborium_io
   2.654s  INFO Compiled [302/527]: time_core
   2.654s  INFO Compiled [303/527]: bytes
   2.654s  INFO Compiled [304/527]: byteorder
   2.654s  INFO Compiled [305/527]: tinyvec_macros
   2.654s  INFO Compiled [306/527]: futures_sink
   2.654s  INFO Compiled [307/527]: utf8_iter
   2.654s  INFO Compiled [308/527]: percent_encoding
   2.654s  INFO Compiled [309/527]: num_conv
   2.654s  INFO Compiled [310/527]: memchr
   2.654s  INFO Compiled [311/527]: powerfmt
   2.654s  INFO Compiled [312/527]: hashbrown
   2.654s  INFO Compiled [313/527]: dioxus_html
   2.654s  INFO Compiled [314/527]: parking_lot
   2.654s  INFO Compiled [316/527]: tokio
   2.654s  INFO Compiled [317/527]: tinyvec
   2.654s  INFO Compiled [318/527]: ciborium_ll
   2.654s  INFO Compiled [319/527]: ppv_lite86
   2.654s  INFO Compiled [322/527]: time_macros
   2.654s  INFO Compiled [323/527]: deranged
   2.654s  INFO Compiled [324/527]: form_urlencoded
   2.654s  INFO Compiled [325/527]: idna
   2.654s  INFO Compiled [326/527]: webpki
   2.654s  INFO Compiled [327/527]: tracing_core
   2.654s  INFO Compiled [328/527]: concurrent_queue
   2.654s  INFO Compiled [330/527]: webpki_roots
   2.654s  INFO Compiled [331/527]: rand_core
   2.654s  INFO Compiled [332/527]: tungstenite
   2.654s  INFO Compiled [333/527]: tungstenite
   2.654s  INFO Compiled [334/527]: serde_urlencoded
   2.655s  INFO Compiled [338/527]: build-script-build
   2.655s  INFO Compiled [339/527]: hashbrown
   2.655s  INFO Compiled [340/527]: log
   2.655s  INFO Compiled [341/527]: spin
   2.655s  INFO Compiled [342/527]: time_core
   2.655s  INFO Compiled [343/527]: parking
   2.655s  INFO Compiled [344/527]: futures_task
   2.655s  INFO Compiled [345/527]: unicase
   2.655s  INFO Compiled [346/527]: pin_utils
   2.655s  INFO Compiled [347/527]: num_conv
   2.655s  INFO Compiled [348/527]: crc_catalog
   2.655s  INFO Compiled [349/527]: regex_syntax
   2.655s  INFO Compiled [350/527]: itoa
   2.655s  INFO Compiled [351/527]: futures_io
   2.655s  INFO Compiled [352/527]: ryu
   2.655s  INFO Compiled [353/527]: url
   2.655s  INFO Compiled [354/527]: time
   2.655s  INFO Compiled [355/527]: multer
   2.655s  INFO Compiled [356/527]: event_listener
   2.655s  INFO Compiled [357/527]: serde_json
   2.655s  INFO Compiled [358/527]: futures_util
   2.655s  INFO Compiled [359/527]: tracing
   2.655s  INFO Compiled [360/527]: mime_guess
   2.655s  INFO Compiled [361/527]: indexmap
   2.655s  INFO Compiled [363/527]: crc
   2.655s  INFO Compiled [364/527]: regex_automata
   2.655s  INFO Compiled [365/527]: thiserror
   2.655s  INFO Compiled [366/527]: webpki_roots
   2.655s  INFO Compiled [367/527]: num_traits
   2.655s  INFO Compiled [368/527]: rustls
   2.655s  INFO Compiled [369/527]: rand_chacha
   2.655s  INFO Compiled [370/527]: tokio_tungstenite
   2.655s  INFO Compiled [371/527]: unicode_normalization
   2.655s  INFO Compiled [372/527]: ciborium
   2.655s  INFO Compiled [373/527]: futures_intrusive
   2.655s  INFO Compiled [374/527]: dioxus_document
   2.655s  INFO Compiled [375/527]: hashlink
   2.655s  INFO Compiled [376/527]: tokio_stream
   2.655s  INFO Compiled [377/527]: web_sys
   2.655s  INFO Compiled [378/527]: crossbeam_queue
   2.655s  INFO Compiled [379/527]: dioxus_history
   2.655s  INFO Compiled [380/527]: hmac
   2.655s  INFO Compiled [381/527]: tokio_stream
   2.655s  INFO Compiled [382/527]: either
   2.655s  INFO Compiled [383/527]: axum_macros
   2.655s  INFO Compiled [384/527]: serde_path_to_error
   2.655s  INFO Compiled [385/527]: uuid
   2.656s  INFO Compiled [386/527]: build-script-build
   2.656s  INFO Compiled [387/527]: http_range_header
   2.656s  INFO Compiled [388/527]: unicode_properties
   2.656s  INFO Compiled [389/527]: tinyvec_macros
   2.656s  INFO Compiled [390/527]: iri_string
   2.656s  INFO Compiled [391/527]: base64
   2.656s  INFO Compiled [392/527]: inventory
   2.656s  INFO Compiled [393/527]: matchit
   2.656s  INFO Compiled [394/527]: foldhash
   2.656s  INFO Compiled [395/527]: psl_types
   2.656s  INFO Compiled [396/527]: unicode_bidi
   2.656s  INFO Compiled [397/527]: litrs
   2.656s  INFO Compiled [398/527]: lazy_static
   2.656s  INFO Compiled [399/527]: heck
   2.656s  INFO Compiled [400/527]: hkdf
   2.656s  INFO Compiled [401/527]: cfb
   2.656s  INFO Compiled [402/527]: axum
   2.656s  INFO Compiled [403/527]: hashbrown
   2.656s  INFO Compiled [404/527]: tower_http
   2.656s  INFO Compiled [405/527]: document_features
   2.656s  INFO Compiled [406/527]: tinyvec
   2.656s  INFO Compiled [407/527]: dioxus_fullstack_core
   2.656s  INFO Compiled [408/527]: stringprep
   2.656s  INFO Compiled [410/527]: sqlx_core
   2.656s  INFO Compiled [411/527]: publicsuffix
   2.656s  INFO Compiled [412/527]: sharded_slab
   2.656s  INFO Compiled [413/527]: matchers
   2.656s  INFO Compiled [414/527]: cookie
   2.656s  INFO Compiled [415/527]: rand
   2.656s  INFO Compiled [416/527]: atoi
   2.656s  INFO Compiled [417/527]: futures_channel
   2.656s  INFO Compiled [418/527]: const_serialize
   2.656s  INFO Compiled [419/527]: wasm_bindgen_futures
   2.656s  INFO Compiled [420/527]: tokio_rustls
   2.656s  INFO Compiled [421/527]: concurrent_queue
   2.656s  INFO Compiled [422/527]: build-script-build
   2.656s  INFO Compiled [423/527]: md5
   2.657s  INFO Compiled [424/527]: rand_core
   2.657s  INFO Compiled [425/527]: headers_core
   2.657s  INFO Compiled [426/527]: futures_executor
   2.657s  INFO Compiled [427/527]: thiserror_impl
   2.657s  INFO Compiled [428/527]: thread_local
   2.657s  INFO Compiled [429/527]: byteorder
   2.657s  INFO Compiled [430/527]: whoami
   2.657s  INFO Compiled [431/527]: crc_catalog
   2.657s  INFO Compiled [432/527]: hex
   2.657s  INFO Compiled [433/527]: parking
   2.657s  INFO Compiled [434/527]: dotenvy
   2.657s  INFO Compiled [435/527]: bitflags
   2.657s  INFO Compiled [436/527]: base16
   2.657s  INFO Compiled [437/527]: utf8parse
   2.657s  INFO Compiled [438/527]: home
   2.657s  INFO Compiled [439/527]: manganis_core
   2.657s  INFO Compiled [440/527]: rand_chacha
   2.657s  INFO Compiled [441/527]: headers
   2.657s  INFO Compiled [442/527]: event_listener
   2.657s  INFO Compiled [444/527]: thiserror
   2.657s  INFO Compiled [445/527]: tracing_subscriber
   2.657s  INFO Compiled [446/527]: futures
   2.657s  INFO Compiled [447/527]: crc
   2.657s  INFO Compiled [448/527]: hyper_rustls
   2.657s  INFO Compiled [449/527]: cookie_store
   2.657s  INFO Compiled [450/527]: sqlx_postgres
   2.657s  INFO Compiled [451/527]: dioxus_router_macro
   2.657s  INFO Compiled [452/527]: anstyle_parse
   2.657s  INFO Compiled [453/527]: unicode_normalization
   2.657s  INFO Compiled [454/527]: hashlink
   2.657s  INFO Compiled [455/527]: infer
   2.657s  INFO Compiled [456/527]: gloo_utils
   2.657s  INFO Compiled [457/527]: tokio_tungstenite
   2.657s  INFO Compiled [458/527]: const_serialize
   2.657s  INFO Compiled [459/527]: charset
   2.657s  INFO Compiled [460/527]: webpki_roots
   2.657s  INFO Compiled [461/527]: crossbeam_queue
   2.657s  INFO Compiled [462/527]: dioxus_devtools_types
   2.657s  INFO Compiled [463/527]: iana_time_zone
   2.657s  INFO Compiled [464/527]: futures_intrusive
   2.657s  INFO Compiled [465/527]: hmac
   2.657s  INFO Compiled [466/527]: serde_qs
   2.657s  INFO Compiled [467/527]: either
   2.657s  INFO Compiled [468/527]: sha2
   2.657s  INFO Compiled [469/527]: derive_more_impl
   2.657s  INFO Compiled [470/527]: macro_string
   2.657s  INFO Compiled [471/527]: async_stream_impl
   2.657s  INFO Compiled [472/527]: const_format
   2.657s  INFO Compiled [473/527]: dunce
   2.657s  INFO Compiled [474/527]: askama_escape
   2.657s  INFO Compiled [475/527]: same_file
   2.657s  INFO Compiled [476/527]: unicode_bidi
   2.657s  INFO Compiled [477/527]: anstyle_query
   2.657s  INFO Compiled [478/527]: colorchoice
   2.657s  INFO Compiled [479/527]: is_terminal_polyfill
   2.657s  INFO Compiled [480/527]: anstyle
   2.657s  INFO Compiled [481/527]: hashbrown
   2.657s  INFO Compiled [482/527]: unicode_properties
   2.657s  INFO Compiled [483/527]: xxhash_rust
   2.657s  INFO Compiled [484/527]: dioxus_ssr
   2.657s  INFO Compiled [485/527]: walkdir
   2.657s  INFO Compiled [486/527]: manganis_macro
   2.657s  INFO Compiled [487/527]: anstream
   2.657s  INFO Compiled [488/527]: dashmap
   2.657s  INFO Compiled [489/527]: async_stream
   2.657s  INFO Compiled [490/527]: derive_more
   2.657s  INFO Compiled [491/527]: sqlx_core
   2.657s  INFO Compiled [492/527]: chrono
   2.657s  INFO Compiled [493/527]: content_disposition
   2.657s  INFO Compiled [494/527]: dioxus_asset_resolver
   2.657s  INFO Compiled [495/527]: hkdf
   2.657s  INFO Compiled [496/527]: dioxus_router
   2.657s  INFO Compiled [497/527]: sqlx_macros_core
   2.657s  INFO Compiled [498/527]: stringprep
   2.657s  INFO Compiled [499/527]: dioxus_fullstack_macro
   2.657s  INFO Compiled [500/527]: manganis_core
   2.657s  INFO Compiled [501/527]: gloo_net
   2.657s  INFO Compiled [502/527]: dioxus_devtools
   2.657s  INFO Compiled [503/527]: dioxus_interpreter_js
   2.657s  INFO Compiled [504/527]: axum_extra
   2.657s  INFO Compiled [505/527]: reqwest
   2.658s  INFO Compiled [506/527]: dioxus_logger
   2.658s  INFO Compiled [507/527]: rand
   2.658s  INFO Compiled [508/527]: wasm_streams
   2.658s  INFO Compiled [509/527]: async_tungstenite
   2.658s  INFO Compiled [510/527]: dioxus_stores_macro
   2.658s  INFO Compiled [511/527]: atoi
   2.658s  INFO Compiled [512/527]: lru
   2.658s  INFO Compiled [513/527]: md5
   2.658s  INFO Compiled [514/527]: tracing_futures
   2.658s  INFO Compiled [515/527]: send_wrapper
   2.658s  INFO Compiled [516/527]: hex
   2.658s  INFO Compiled [517/527]: clap_lex
   2.658s  INFO Compiled [518/527]: xxhash_rust
   2.658s  INFO Compiled [519/527]: const_str
   2.658s  INFO Compiled [520/527]: home
   2.658s  INFO Compiled [521/527]: strsim
   2.658s  INFO Compiled [522/527]: whoami
   2.658s  INFO Compiled [523/527]: dotenvy
   2.658s  INFO Compiled [524/527]: dioxus_stores
   2.658s  INFO Compiled [525/527]: manganis
   2.658s  INFO Compiled [526/527]: sqlx_macros
   2.658s  INFO Compiled [527/527]: clap_derive
   2.658s  INFO Compiled [528/527]: dioxus_config_macro
   2.658s  INFO Compiled [529/527]: dioxus_config_macros
   2.658s  INFO Compiled [530/527]: sqlx_postgres
   2.658s  INFO Compiled [531/527]: dioxus_fullstack
   2.658s  INFO Compiled [532/527]: clap_builder
   2.658s  INFO Compiled [533/527]: dioxus_server
   2.658s  INFO Compiled [534/527]: dioxus
   2.658s  INFO Compiled [535/527]: clap
   2.658s  INFO Compiled [536/527]: sqlx
   2.658s  INFO Compiled [537/527]: bits
   4.266s  INFO Compiled [538/527]: bits
   4.306s  INFO Bundling app...
   4.306s  INFO Server build completed successfully! 🚀 path="/Users/jcf/code/bits/target/dx/bits/release/web/public"
   4.306s  INFO Bundled app at: /Users/jcf/code/bits/target/dx/bits/release/web/bits
   4.307s  INFO Bundled app at: /Users/jcf/code/bits/target/dx/bits/release/web/public
#+end_example

** Artifacts
#+begin_src sh :results output verbatim
tree target/dx/bits/release/web
#+end_src

#+results:
#+begin_example
target/dx/bits/release/web
├── bits
└── public
    ├── assets
    │   ├── app-dxh5d12b56ec9946e7f.css
    │   ├── bits-dxhaea3677ffb77dc41.js
    │   └── bits_bg-dxhf7c56d51fe8c108a.wasm
    └── index.html

3 directories, 5 files
#+end_example

#+begin_src sh :results output verbatim
target/dx/bits/release/web/bits --help
#+end_src

#+results:
: Usage: bits [COMMAND]
:
: Commands:
:   admin
:   serve
:   help   Print this message or the help of the given subcommand(s)
:
: Options:
:   -h, --help  Print help

** Clean
#+begin_src emacs-lisp :results silent :eval query
(delete-directory "target/dx/bits/release" t)
#+end_src

* CLI
#+begin_src sh :results output verbatim
target/dx/bits/release/web/bits --help
#+end_src

#+results:
: Usage: bits [COMMAND]
:
: Commands:
:   admin
:   serve
:   help   Print this message or the help of the given subcommand(s)
:
: Options:
:   -h, --help  Print help

#+begin_src sh :results output verbatim
target/dx/bits/release/web/bits admin
#+end_src

#+results:
: Hello, administrator.
